name: "AlexNet-Custom"
input: "data_1"
input_dim: 5
input_dim: 3
input_dim: 96
input_dim: 96
input: "data_2"
input_dim: 5
input_dim: 3
input_dim: 96
input_dim: 96
input: "data_3"
input_dim: 5
input_dim: 3
input_dim: 96
input_dim: 96
input: "label"
input_dim: 5
input_dim: 1
input_dim: 1
input_dim: 1

# ================================================================================================
# ================================================================================================
# ======== NETWORK 1
# ================================================================================================
# ================================================================================================

layer {
  name: "conv1"
  type: "Convolution"
  bottom: "data_1"
  top: "conv1"
  param {
    lr_mult: 0.7
    decay_mult: 1
    name: "conv1_w"
  }
  param {
    lr_mult: 2
    decay_mult: 0
    name: "conv1_b"
  }
  convolution_param {
    num_output: 96
    kernel_size: 11
    stride: 4
    pad: 5
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "bn1"
  type: "BatchNorm"
  bottom: "conv1"
  top: "bn1"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}

layer {
  name: "relu1"
  type: "ReLU"
  bottom: "bn1"
  top: "relu1"
}

layer {
  name: "pool1"
  type: "Pooling"
  bottom: "relu1"
  top: "pool1"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "conv2"
  type: "Convolution"
  bottom: "pool1"
  top: "conv2"
  param {
    name: "conv2_w"
    lr_mult: 0.8
    decay_mult: 1
  }
  param {
    name: "conv2_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 2
    kernel_size: 5
    group: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}
layer {
  name: "bn2"
  type: "BatchNorm"
  bottom: "conv2"
  top: "bn2"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}

layer {
  name: "relu2"
  type: "ReLU"
  bottom: "bn2"
  top: "relu2"
}

layer {
  name: "pool2"
  type: "Pooling"
  bottom: "relu2"
  top: "pool2"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "conv3"
  type: "Convolution"
  bottom: "pool2"
  top: "conv3"
  param {
    name: "conv3_w"
    lr_mult: 0.9
    decay_mult: 1
  }
  param {
    name: "conv3_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 384
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "bn3"
  type: "BatchNorm"
  bottom: "conv3"
  top: "bn3"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}

layer {
  name: "relu3"
  type: "ReLU"
  bottom: "bn3"
  top: "relu3"
}
layer {
  name: "conv4"
  type: "Convolution"
  bottom: "relu3"
  top: "conv4"
  param {
    name: "conv4_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "conv4_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 384
    pad: 1
    kernel_size: 3
    group: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}
layer {
  name: "bn4"
  type: "BatchNorm"
  bottom: "conv4"
  top: "bn4"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}

layer {
  name: "relu4"
  type: "ReLU"
  bottom: "bn4"
  top: "relu4"
}
layer {
  name: "conv5"
  type: "Convolution"
  bottom: "relu4"
  top: "conv5"
  param {
    name: "conv5_w"
    lr_mult: 0.9
    decay_mult: 1
  }
  param {
    name: "conv5_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    group: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}
layer {
  name: "bn5"
  type: "BatchNorm"
  bottom: "conv5"
  top: "bn5"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}

layer {
  name: "relu5"
  type: "ReLU"
  bottom: "bn5"
  top: "relu5"
}
layer {
  name: "pool5"
  type: "Pooling"
  bottom: "relu5"
  top: "pool5"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "fc6"
  type: "InnerProduct"
  bottom: "pool5"
  top: "fc6"
  param {
    name: "fc6_w"
    lr_mult: 0.8
    decay_mult: 1
  }
  param {
    name: "fc6_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 4096
    weight_filler {
      type: "gaussian"
      std: 0.005
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}
layer {
  name: "bn6"
  type: "BatchNorm"
  bottom: "fc6"
  top: "bn6"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}

layer {
  name: "relu6"
  type: "ReLU"
  bottom: "bn6"
  top: "relu6"
}

# ================================================================================================
# ================================================================================================
# ======== NETWORK 2
# ================================================================================================
# ================================================================================================

layer {
  name: "conv1_s"
  type: "Convolution"
  bottom: "data_2"
  top: "conv1_s"
  param {
    lr_mult: 0.7
    decay_mult: 1
    name: "conv1_w"
  }
  param {
    lr_mult: 2
    decay_mult: 0
    name: "conv1_b"
  }
  convolution_param {
    num_output: 96
    kernel_size: 11
    stride: 4
    pad: 5
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "bn1_s"
  type: "BatchNorm"
  bottom: "conv1_s"
  top: "bn1_s"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}

layer {
  name: "relu1_s"
  type: "ReLU"
  bottom: "bn1_s"
  top: "relu1_s"
}

layer {
  name: "pool1_s"
  type: "Pooling"
  bottom: "relu1_s"
  top: "pool1_s"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "conv2_s"
  type: "Convolution"
  bottom: "pool1_s"
  top: "conv2_s"
  param {
    name: "conv2_w"
    lr_mult: 0.8
    decay_mult: 1
  }
  param {
    name: "conv2_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 2
    kernel_size: 5
    group: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}
layer {
  name: "bn2_s"
  type: "BatchNorm"
  bottom: "conv2_s"
  top: "bn2_s"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}

layer {
  name: "relu2_s"
  type: "ReLU"
  bottom: "bn2_s"
  top: "relu2_s"
}

layer {
  name: "pool2_s"
  type: "Pooling"
  bottom: "relu2_s"
  top: "pool2_s"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "conv3_s"
  type: "Convolution"
  bottom: "pool2_s"
  top: "conv3_s"
  param {
    name: "conv3_w"
    lr_mult: 0.9
    decay_mult: 1
  }
  param {
    name: "conv3_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 384
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "bn3_s"
  type: "BatchNorm"
  bottom: "conv3_s"
  top: "bn3_s"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}

layer {
  name: "relu3_s"
  type: "ReLU"
  bottom: "bn3_s"
  top: "relu3_s"
}
layer {
  name: "conv4_s"
  type: "Convolution"
  bottom: "relu3_s"
  top: "conv4_s"
  param {
    name: "conv4_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "conv4_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 384
    pad: 1
    kernel_size: 3
    group: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}
layer {
  name: "bn4_s"
  type: "BatchNorm"
  bottom: "conv4_s"
  top: "bn4_s"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}

layer {
  name: "relu4_s"
  type: "ReLU"
  bottom: "bn4_s"
  top: "relu4_s"
}
layer {
  name: "conv5_s"
  type: "Convolution"
  bottom: "relu4_s"
  top: "conv5_s"
  param {
    name: "conv5_w"
    lr_mult: 0.9
    decay_mult: 1
  }
  param {
    name: "conv5_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    group: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}
layer {
  name: "bn5_s"
  type: "BatchNorm"
  bottom: "conv5_s"
  top: "bn5_s"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}

layer {
  name: "relu5_s"
  type: "ReLU"
  bottom: "bn5_s"
  top: "relu5_s"
}
layer {
  name: "pool5_s"
  type: "Pooling"
  bottom: "relu5_s"
  top: "pool5_s"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "fc6_s"
  type: "InnerProduct"
  bottom: "pool5_s"
  top: "fc6_s"
  param {
    name: "fc6_w"
    lr_mult: 0.8
    decay_mult: 1
  }
  param {
    name: "fc6_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 4096
    weight_filler {
      type: "gaussian"
      std: 0.005
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}
layer {
  name: "bn6_s"
  type: "BatchNorm"
  bottom: "fc6_s"
  top: "bn6_s"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}

layer {
  name: "relu6_s"
  type: "ReLU"
  bottom: "bn6_s"
  top: "relu6_s"
}

# ================================================================================================
# ================================================================================================
# ======== NETWORK 3
# ================================================================================================
# ================================================================================================

layer {
  name: "conv1_t"
  type: "Convolution"
  bottom: "data_3"
  top: "conv1_t"
  param {
    lr_mult: 0.7
    decay_mult: 1
    name: "conv1_w"
  }
  param {
    lr_mult: 2
    decay_mult: 0
    name: "conv1_b"
  }
  convolution_param {
    num_output: 96
    kernel_size: 11
    stride: 4
    pad: 5
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "bn1_t"
  type: "BatchNorm"
  bottom: "conv1_t"
  top: "bn1_t"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}

layer {
  name: "relu1_t"
  type: "ReLU"
  bottom: "bn1_t"
  top: "relu1_t"
}

layer {
  name: "pool1_t"
  type: "Pooling"
  bottom: "relu1_t"
  top: "pool1_t"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "conv2_t"
  type: "Convolution"
  bottom: "pool1_t"
  top: "conv2_t"
  param {
    name: "conv2_w"
    lr_mult: 0.8
    decay_mult: 1
  }
  param {
    name: "conv2_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 2
    kernel_size: 5
    group: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}
layer {
  name: "bn2_t"
  type: "BatchNorm"
  bottom: "conv2_t"
  top: "bn2_t"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}

layer {
  name: "relu2_t"
  type: "ReLU"
  bottom: "bn2_t"
  top: "relu2_t"
}

layer {
  name: "pool2_t"
  type: "Pooling"
  bottom: "relu2_t"
  top: "pool2_t"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "conv3_t"
  type: "Convolution"
  bottom: "pool2_t"
  top: "conv3_t"
  param {
    name: "conv3_w"
    lr_mult: 0.9
    decay_mult: 1
  }
  param {
    name: "conv3_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 384
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "bn3_t"
  type: "BatchNorm"
  bottom: "conv3_t"
  top: "bn3_t"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}

layer {
  name: "relu3_t"
  type: "ReLU"
  bottom: "bn3_t"
  top: "relu3_t"
}
layer {
  name: "conv4_t"
  type: "Convolution"
  bottom: "relu3_t"
  top: "conv4_t"
  param {
    name: "conv4_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "conv4_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 384
    pad: 1
    kernel_size: 3
    group: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}
layer {
  name: "bn4_t"
  type: "BatchNorm"
  bottom: "conv4_t"
  top: "bn4_t"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}

layer {
  name: "relu4_t"
  type: "ReLU"
  bottom: "bn4_t"
  top: "relu4_t"
}
layer {
  name: "conv5_t"
  type: "Convolution"
  bottom: "relu4_t"
  top: "conv5_t"
  param {
    name: "conv5_w"
    lr_mult: 0.9
    decay_mult: 1
  }
  param {
    name: "conv5_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    group: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}
layer {
  name: "bn5_t"
  type: "BatchNorm"
  bottom: "conv5_t"
  top: "bn5_t"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}

layer {
  name: "relu5_t"
  type: "ReLU"
  bottom: "bn5_t"
  top: "relu5_t"
}
layer {
  name: "pool5_t"
  type: "Pooling"
  bottom: "relu5_t"
  top: "pool5_t"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "fc6_t"
  type: "InnerProduct"
  bottom: "pool5_t"
  top: "fc6_t"
  param {
    name: "fc6_w"
    lr_mult: 0.8
    decay_mult: 1
  }
  param {
    name: "fc6_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 4096
    weight_filler {
      type: "gaussian"
      std: 0.005
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}
layer {
  name: "bn6_t"
  type: "BatchNorm"
  bottom: "fc6_t"
  top: "bn6_t"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}

layer {
  name: "relu6_t"
  type: "ReLU"
  bottom: "bn6_t"
  top: "relu6_t"
}

# ================================================================================================
# ================================================================================================
# ======== JOIN NETWORK 1, 2 AND 3
# ================================================================================================
# ================================================================================================

layer {
	name: "joined_concat"
	type: "Concat"
	bottom: "relu6"
	bottom: "relu6_s"
	bottom: "relu6_t"
	top: "joined_concat"
}

layer {
  name: "joined_fc1"
  type: "InnerProduct"
  bottom: "joined_concat"
  top: "joined_fc1"
  param {
    lr_mult: 0.7
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 4096
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "joined_bn1"
  type: "BatchNorm"
  bottom: "joined_fc1"
  top: "joined_bn1"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}

layer {
  name: "joined_relu1"
  type: "ReLU"
  bottom: "joined_bn1"
  top: "joined_relu1"
}

layer {
  name: "joined_fc2"
  type: "InnerProduct"
  bottom: "joined_relu1"
  top: "joined_fc2"
  param {
    lr_mult: 0.6
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 4096
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "joined_bn2"
  type: "BatchNorm"
  bottom: "joined_fc2"
  top: "joined_bn2"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
}

layer {
  name: "joined_relu2"
  type: "ReLU"
  bottom: "joined_bn2"
  top: "joined_relu2"
}

# ================================================================================================
# ======== Loss
# ================================================================================================

layer {
  name: "joined_fc3"
  type: "InnerProduct"
  bottom: "joined_relu2"
  top: "joined_fc3"
  param {
    lr_mult: 0.5
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 80
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "accuracy"
  type: "Accuracy"
  bottom: "joined_fc3"
  bottom: "label"
  top: "accuracy"
  include {
    phase: TEST
  }
}

layer {
  name: "loss"
  type: "SoftmaxWithLoss"
  bottom: "joined_fc3"
  bottom: "label"
  top: "loss"
}

layer {
      name: "softmax_plain"
      type: "Softmax"
      bottom: "joined_fc3"
      top: "softmax_plain"
      loss_weight: 0	
}

layer {
      name: "softmax_plain_silence"
      type: "Silence"
      bottom: "softmax_plain"
}
